Repository: tolisster/starlab-task
Catalog: src/locale/messages.*.xlf
Languages: ro

source: Step
ro: Pas

source: Location Info
ro: Informații despre locație

source: Legal Name
ro: Denumirea juridică

source: Trade Name
ro: Denumirea comercială

source: Name is required.
ro: Denumirea este necesară.

source: Name must be no more than {inputMaxLength, plural, =1 {...} other {...}}.
ro: Denumirea nu trebuie să depășească {inputMaxLength, plural, =1 {...} few {...} other {...}}.

source: {VAR_PLURAL, plural, =1 {1 character} other {{{inputMaxLength}} characters} }
ro: {VAR_PLURAL, plural, =1 {1 simbol} few {{{inputMaxLength}} simbole} other {{{inputMaxLength}} de simbole} }

source: Discount StarNet
ro: Reducere StarNet

source: Discount is required.
ro: Reducere este necesară.

source: Discount must be at least {{discountMin}}%.
ro: Reducerile trebuie să fie de cel puțin {{discountMin}}%.

source: Discount should not exceed {{discountMax}}%.
ro: Reducerea nu trebuie să depășească {{discountMax}}%.

source: Activating the reservation
ro: Activarea bronării

source: Category
ro: Categorie

source: Category is required.
ro: Categorie este necesară.

source: Select the average sum of the single order
ro: Selectați suma medie a comenzii unice

source: Sum is required.
ro: Suma este necesară.

source: Description RO
ro: Descriere RO

source: Description is required.
ro: Descriere este necesară.

source: Description must be no more than {textareaMaxLength, plural, =1 {...} other {...}}.
ro: Descriere nu trebuie să depășească {textareaMaxLength, plural, =1 {...} few {...} other {...}}.

source: {VAR_PLURAL, plural, =1 {1 character} other {{{textareaMaxLength}} characters} }
ro: {VAR_PLURAL, plural, =1 {1 simbol} few {{{inputMaxLength}} simbole} other {{{textareaMaxLength}} de simbole} }

source: Description RU
ro: Descriere RU

source: Cancel
ro: Anulare

source: Next
ro: Următor

source: Toggle navigation
ro: Comutare navigare

source: log out
ro: ieșire
